# Pandas Exercices - Solutions

Il est temps de tester vos nouvelles compétences en pandas ! Utilisez le fichier csv de ce dossier pour effectuer les tâches en gras ci-dessous!

#### NOTE : TOUTES LES TÂCHES DOIVENT ÊTRE EFFECTUÉES SUR UNE SEULE LIGNE AVEC DU CODE PANDAS. BLOQUé(e) ? PAS DE PROBLÈME ! CONSULTEZ LE NOTEBOOK AVEC LES SOLUTIONS !

##### Importer pandas et lire le fichier banklist.csv dans un dataframe nommé banks.

##### Afficher les 5 premières lignes du dataframe

In [3]:
# CODE ICI

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

##### Quels sont les noms de colonne?

In [5]:
# CODE ICI

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

##### Combien d'états (ST) sont représentés dans cet ensemble de données?

In [7]:
# CODE ICI

44

##### Obtenir une liste ou tableau de tous les états du dataset.

In [9]:
# CODE ICI

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

##### Quels sont les 5 états avec le plus de banques en faillite?

In [11]:
# CODE ICI

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

##### Quels sont les 5 principaux établissements acquéreurs?

In [13]:
# CODE ICI

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

##### Combien de banques State Bank of Texas a-t-elle acquises ? Combien d'entre elles étaient au Texas ?

In [15]:
# CODE ICI

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

##### Quelle est la ville la plus fréquente en Californie pour qu'une banque fasse faillite ?

In [17]:
# CODE ICI

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

##### Combien de banques en faillite n'ont pas le mot "Bank" dans leur nom?

In [19]:
# CODE ICI

14

##### Combien de noms de banques commencent par la lettre 's' ?

In [21]:
# CODE ICI

53

##### Combien de valeurs CERT sont supérieures à 20000 ?

In [23]:
# CODE ICI

417

##### Combien de noms de banques se composent de seulement deux mots ? (par exemple "First Bank" et "Bank Georgia")

In [25]:
# CODE ICI

114

#### Bonus: Combien de banques ont fermé en 2008 ? (c'est difficile parce que techniquement nous n'avons pas encore vu les séries temporelles avec pandas ! N'hésitez pas à passer !

In [27]:
# CODE ICI

25

# Bon travail!